app/controllers/api/houses_controller.rb

INSERT INTO "houses" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-06 14:55:23.560184"], ["name", "Huis"], ["password_digest", "$2a$10$7ApM8zsua3MGwp3OlVBSeOOzj4zglkqAjCzsfVzvdEzUqXkwlupBy"], ["updated_at", "2014-12-06 14:55:23.560184"]]
INSERT INTO "apikeys" ("access_token", "created_at", "house_id", "updated_at") VALUES (?, ?, ?, ?)  [["access_token", "fdb48b65269f96c5d8bf6f1f4352b739"], ["created_at", "2014-12-06 23:17:08.701703"], ["house_id", 1], ["updated_at", "2014-12-06 23:17:08.701703"]]
---
  def create
    @house  = House.new(house_params)

    if @house.save
      @apikey = Apikey.create(:house_id => @house.id)

SELECT "users".* FROM "users"  WHERE "users"."house_id" IS NULL
---
  def get_habitants
      @users = User.where(:house_id => params[:id])

SELECT "users".* FROM "users"  WHERE "users"."house_id" = 1
---
  def send_invite_mail
       @users   = User.where(:house_id => params[:id])