app/controllers/api/sessions_controller.rb

  def create
    @house = House.find_by_name(login_params[:name])

    if @house && @house.authenticate(login_params[:password])

      @apikey = Apikey.where("house_id = ?", @house.id)
---
SELECT  "apikeys".* FROM "apikeys"  WHERE "apikeys"."house_id" = 9  ORDER BY "apikeys"."id" DESC LIMIT 1