app/controllers/api/tasks_controller.rb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."house_id" = ?  ORDER BY "tasks"."deadline" ASC  [["house_id", 1]]
SELECT "tasks".* FROM "tasks"   ORDER BY "tasks"."deadline" ASC
---
  def index
    @tasks = Task.where(:house_id => params[:house_id]).order(:deadline)

    tasks = []

    # voeg een avatar aan de taak toe als deze bestaat
    @tasks.each do |task|

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "house_id" = ?, "points" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["house_id", 1], ["points", 15], ["updated_at", "2014-12-07 10:06:29.765659"]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update_attributes(task_params)

INSERT INTO "tasks" ("created_at", "house_id", "name", "points", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-07 09:46:48.147486"], ["house_id", 1], ["name", "WC schoonmaken"], ["points", 15], ["updated_at", "2014-12-07 09:46:48.147486"]]
---
  def create
    @task  = Task.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @task = Task.find(params[:id])

    if @task
        @task.destroy