app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 'id' LIMIT 1
UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["avatar_file_name", "03_-_b4kYn07.jpg"], ["avatar_file_size", 764565], ["avatar_updated_at", "2014-12-17 12:51:18.742878"], ["updated_at", "2014-12-17 12:51:19.643491"]]
---
    def update
        @user = User.find_by_id(params[:id])

        if @user.update_attributes(user_params)